{
  "tutorials": [{
    "id": "1",
    "tag": "wifi",
    "header": "Wi-Fi ni Noma!",
    "photoUrl": "url",
    "steps": [{
        "id": "1",
        "title": "What is Wi-Fi?",
        "gifUrl": "wifi1",
        "description": "Wi-Fi <img src=\"ic_network_wifi_white_24dp\"/> is a technology that helps your phone connect to the internet, similar to airtime or mobile data. However, <b><font color=\"#E4BC4D\">Wi-Fi doesn't use your airtime or mobile data.</font></b> Wi-Fi can often be free in coffee shops, or accessible at a small fee."
    }, {
        "id": "2",
        "title": "Where do I get it? Who owns it?",
        "gifUrl": "wifi2",
        "description": "Wi-Fi networks are created by \"hotspots\" that connect to the internet. Anyone can buy one and set it up at home, at work, or in a public space. If you can detect a Wi-Fi network on your phone, you might be able to connect to it. To learn more about connecting, check out <a href=\"mozilladso:///tutorials/connect_wifi\">Connecting to Wi-Fi</a>."
    }, {
        "id": "3",
        "title": "Saving Money",
        "gifUrl": "wifi3",
        "description": "Connecting to a Wi-Fi hotspot saves money because it lets you use the internet without using mobile data or airtime on your phone. Remember, though, sometimes you have to pay a small fee to use Wi-Fi at a business or cafe, or buy some goods.<br><br>Many phones are capable of creating hotspots <img src=\"ic_wifi_tethering_white_24dp\"/>. <b><font color=\"#E4BC4D\">If you let other people connect to your phone's hotspot, it may consume your data.</font></b>"
    }, {
        "id": "4",
        "title": "Speed and Stability",
        "gifUrl": "wifi4",
        "description": "Wi-Fi networks are generally more stable and faster than mobile data networks. Downloading files or watching videos is best over Wi-Fi.\n<b><font color=\"#E4BC4D\">Be aware:</font></b> it is not <b><font color=\"#E4BC4D\">always</font></b> the case that Wi-Fi is faster and more stable than mobile data. Depending on infrastructure, popularity, and other environmental factors, Wi-Fi may not be as responsive or reliable."
    }]
  },{
    "id": "2",
    "tag": "connect_wifi",
    "header": "Connecting to Wi-Fi",
    "photoUrl": "url",
    "steps": [{
        "id": "1",
        "title": "Finding Names and Passwords",
        "gifUrl": "connectwifi1",
        "description": "To connect to a Wi-Fi hotspot, you will need <b> <font color=\"#E4BC4D\">the name of the hotspot</font></b> and, in some cases, <b> <font color=\"#E4BC4D\">its password</font></b>. If you are in a business, cafe, or other public space, you can usually ask the owner of the hotspot for this information. Some places charge a small fee for using their Wi-Fi."
    }, {
        "id": "2",
        "title": "Turning on Wi-Fi",
        "gifUrl": "connectwifi2",
        "description": "On most Android phones, you can swipe down the Notification Bar at the top of the screen and tap the Wi-Fi <img src=\"ic_network_wifi_white_24dp\"/> icon. If you are close to a Wi-Fi network you have joined before, <b><font color=\"#E4BC4D\">your phone will try to connect to it automatically</font></b>. You can also manage your Wi-Fi connection by clicking on the Settings <img src=\"ic_settings_applications_white_24dp\"/> and checking out the Wi-Fi section."
    }, {
        "id": "3",
        "title": "Finding your hotspot in the Wi-Fi list",
        "gifUrl": "connectwifi4",
        "description": "Look at the list of networks that appear and click on the one that you want to connect to."
    }, {
        "id": "4",
        "title": "Entering a Password",
        "gifUrl": "connectwifi6",
        "description": "<i>If your phone has already connected to the correct Wi-Fi hotspot, you can skip this step.</i><br><br>Some Wi-Fi hotspots require a password. In this case, a box will appear that asks for a password. If you don’t know the password, ask for help from the owner of the hotspot. Once you have the password, use the keyboard that pops up to enter it."
    }, {
        "id": "5",
        "title": "Fixing Problems",
        "gifUrl": "connectwifi7",
        "description": "If you have problems connecting to a Wi-Fi hotspot, here is a list of things you can try. <br><ul><li>Make sure you have the right hotspot name.</li><li>Make sure you have the right password.</li><li>If you have the right password, make sure it's entered correctly.</li><li>Talk to the hotspot owner (shopkeeper, librarian, IT assistant, etc.) and explain your problems. They may be able to help solve your problem.</li><li>In the Wi-Fi menu, delete the hotspot by holding its name until a menu appears. Then, choose <b><font color=\"#E4BC4D\">\"Forget Network\"</font></b>, and connect again.</li></ul>"
    }, {
        "id": "6",
        "title": "Enjoy :happy:",
        "gifUrl": "connectwifi9",
        "description": "Now, you should be connected! Enjoy! :happy:"
      }]
  }, {
    "id": "3",
    "tag": "data",
    "header": "Using your Mobile Data Wisely",
    "photoUrl": "url",
    "steps": [{
        "id": "1",
        "title": "Mobile Data vs. Wi-Fi",
        "gifUrl": "data1",
        "description": "To access the internet, your phone uses a <b><font color=\"#E4BC4D\">mobile data</font></b> connection or a <b><font color=\"#E4BC4D\">Wi-Fi</font></b> connection.<br><ul><li>Mobile data is sold by your service provider and is measured in kilobytes, megabytes and gigabytes.</li><li>Wi-Fi hotspots rely on service providers for their internet, too. So, <b><font color=\"#E4BC4D\">connecting to a Wi-Fi hotspot, will use its data instead of yours.</font></b></li></ul>"
    }, {
        "id": "2",
        "title": "Apps Use Data",
        "gifUrl": "data2",
        "description": "<b><font color=\"#E4BC4D\">Data is used to move content around the internet.</font></b> Many apps (Google, Yahoo, Facebook, WhatsApp, Opera, Instagram, Branch) will consume data because they connect to the internet. Applications like Opera Mini use less data than others because they restrict images and video. Others, like YouTube, use much more data because they use video content."
    }, {
        "id": "3",
        "title": "Restrict Background Data",
        "gifUrl": "data4",
        "description": "The easiest way to save data is to tell your apps (or the Android system itself) to <b><font color=\"#E4BC4D\">restrict background data</font></b>. Some apps continue to use data (in the \"background\") when you're not specifically using them: syncing email, updating feeds, checking the weather, etc."
    }, {
        "id": "4",
        "title": "Disable Auto-update",
        "gifUrl": "auto_update",
        "description": "If some of your apps were downloaded through the Play Store they may be using \"auto-update\" could be consuming your data without you even knowing.<br><br>To check, open <b><font color=\"#E4BC4D\">Play Store</font></b>, find <b><font color=\"#E4BC4D\">Settings</font></b>, and then <b><font color=\"#E4BC4D\">Auto Update apps</font></b>. Make sure <i>Auto-update apps at any time</i> is <b>not</b> selected."
    }, {
        "id": "5",
        "title": "Check your Apps' Settings",
        "gifUrl": "data5",
        "description": "Some applications are designed to do work even when you're not specifically using them. Most of them use <b><font color=\"#E4BC4D\">data by default</font></b> usually to provide you with regular notifications or updates.\n<br>Check the settings or preferences in your apps to verify that they aren't using data all the time. In some cases, you can have the choice to \"sync\" (connect to the internet) over Wi-Fi only.<br><br><b><font color=\"#E4BC4D\">In Chrome</font></b>, you can turn on \"Data Saver\" in the settings to save up to 35% of your data usage.<br><br><b><font color=\"#E4BC4D\">In Opera</font></b>, you can use \"compression\" that will let you enjoy the internet and save data."
    }, {
        "id": "6",
        "title": "Check your WhatsApp Settings",
        "gifUrl": "data6",
        "description": "You can also restrict the data consumption inside WhatsApp by changing some of its settings. <ul><li>Open WhatsApp</li><li>Click on settings</li><li>Click on <b><font color=\"#E4BC4D\">Data Usage</font></b></li><li>Choose the content that your phone can download over mobile data</li><li>Choose the content that you allow your phone to download on Wi-Fi</li><li>Choose if you want to lower the amount of data usage during WhatsApp calls</li></ul>"
    }]
  },{
    "id": "4",
    "tag": "tracking_data",
    "header": "Tracking your Data Usage",
    "photoUrl": "url",
    "steps": [{
      "id": "1",
      "title": "Data consumption",
      "gifUrl": "trackingdata1",
      "description": "Each Android phone comes with a menu where you can follow your data consumption. You will be able to follow your data consumption over time, but also to see which apps consume data.\nIt might look different on different phones, but should be accessible within the <b><font color=\"#E4BC4D\">Settings</font></b> <img src=\"ic_settings_applications_white_24dp\"/> app. Find the option that says <b><font color=\"#E4BC4D\">Data Usage</font></b> <img src=\"ic_data_usage_white_24dp\"/>."
    }, {
      "id": "2",
      "title": "Inspecting your Data Usage",
      "gifUrl": "trackingdata2",
      "description": "With <b><font color=\"#E4BC4D\">Data Usage</font></b> there are two things to notice:\n<br><br>The graph at the top shows how much data you use over time. At the end of each day, you can see how much of your data has been consumed. You can reset this graph when you buy data."
    }, {
      "id": "3",
      "title": "Apps",
      "gifUrl": "trackingdata3",
      "description": "Below the graph is a list of apps that have been consuming data. Check this list to make sure there are no apps you didn’t expect to be there. For example, you might discover that Gmail <img src=\"gmail_24dp\"/> consumed 50MB of data recently, but you rarely use Gmail. This might mean that you should change your settings inside the app, or restrict the apps data usage.\nTo see the usage of any app in particular, simply click on its icon in the list."
    }, {
      "id": "4",
      "title": "Data Usage Tips",
      "gifUrl": "data2",
      "description": "There are many ways to make sure your phone uses small amounts of data, or only uses data when you want it to.\nFor more information and tips, check out <a href=\"mozilladso:///tutorials/data\">Mobile Data Consumption</a>."
    }]
  },{
    "id": "5",
    "tag": "airplane_mode",
    "header": "Airplane Mode",
    "photoUrl": "url",
    "steps": [{
      "id": "1",
      "title": "Finding the Airplane Mode button",
      "gifUrl": "airplanemode1",
      "description": "Turning on Airplane Mode instantly disables <b><font color=\"#E4BC4D\">all wireless functionality</font></b> of your phone. For example, Wi-Fi, Cell, Bluetooth, and GPS will not operate.\nThis feature is useful for keeping your phone on, but limiting its contact with networks. Until you turn Airplane Mode off, you will not be able to receive phone calls or access the internet."
    }, {
      "id": "2",
      "title": "In the Notification Bar",
      "gifUrl": "airplanemode2",
      "description": "On newer phones, simply swipe down the Title Bar at the top of your screen, and look for the airplane icon<img src=\"ic_airplanemode_active_white_24dp\"/>. Tap the icon to turn Airplane Mode <b><font color=\"#E4BC4D\">ON</font></b> or <b><font color=\"#E4BC4D\">OFF</font></b>."
    }, {
      "id": "3",
      "title": "In the Wireless Settings Menu",
      "gifUrl": "airplanemode3",
      "description": "You can also toggle Airplane Mode from the Settings menu. On all Android phones, including older phones, open <b><font color=\"#E4BC4D\">Settings</font></b> <img src=\"ic_settings_applications_white_24dp\"/>, choose \"<b><font color=\"#E4BC4D\">More…</font></b>\" in the <b><font color=\"#E4BC4D\">Wireless & Networks</> section, and check the box that says \"<b><font color=\"#E4BC4D\">Airplane Mode</font></b>\"."
    }, {
      "id": "4",
      "title": "Using Wi-Fi",
      "gifUrl": "airplanemode4",
      "description": "Even with Airplane mode turned on, you are still able to use Wi-Fi if you switch it on explicitly. This will ensure that mobile data is not used. Check out <a href=\"mozilladso:///tutorials/connect_wifi\">Connecting to Wi-Fi</a> for more information."
    }]
  },{
    "id": "6",
    "tag": "storage",
    "header": "Freeing up Memory",
    "photoUrl": "url",
    "steps": [{
      "id": "1",
      "title": "Storage Space",
      "gifUrl": "storage1",
      "description": "Your phone has limited space for apps, videos, images, and other content you have stored. On some phones, there is space set aside <b><font color=\"#E4BC4D\">just for apps</font></b>. Usually, this space is much smaller than the total available space, and <font color=\"#E4BC4D\">may cause unexpected problems when installing apps</font>.<br><br>There are a few things you can check to free up some space."
    }, {
      "id": "2",
      "title": "Checking your Storage",
      "gifUrl": "storage2",
      "description": "Within the <b><font color=\"#E4BC4D\">Settings</font></b> <img src=\"ic_settings_applications_white_24dp\"/> app you’ll find the <b><font color=\"#E4BC4D\">Storage & USB</font></b> <img src=\"ic_storage_white_24dp\"/> menu. You will be shown a breakdown of the Apps, Images, Videos, Audio, and Other content that's using up your phone's memory."
    }, {
      "id": "3",
      "title": "Evaluating Items",
      "gifUrl": "storage3",
      "description": "The size of content on your phone is measured in MB, and GB, where MB is the smallest, and GB is the biggest. If an app consumes 2GB of space, it is much larger than an image that consumes 2MB.\nConfirm that the size of each type of content is as you expect and as you want. If your phone has many images and you’re having trouble installing a new app, consider deleting some."
    }]
  },{
  "id": "7",
    "tag": "playstore",
    "header": "The Play Store",
    "photoUrl": "url",
    "steps": [{
      "id": "1",
      "title": "Home of Many Apps",
      "gifUrl": "playstore1",
      "description": "The Play Store lets you download apps on your phone. You can search for different kinds of apps like <b><font color=\"#E4BC4D\">games, learning apps, social media apps, photo-editing apps</font></b>, and more.\n<br><br>Some apps on the Play Store are free, and some cost money. Don’t worry though: you will always be asked to confirm if you are about to spend money."
    }, {
      "id": "2",
      "title": "Opening the Play Store",
      "gifUrl": "playstore2",
      "description": "To start, look for the <b><font color=\"#E4BC4D\">Play Store</font></b> icon on your home screen. If you can’t find it, try looking in the <b><font color=\"#E4BC4D\">Apps Menu</font></b><img src=\"ic_blur_circular_white_24dp\"/>."
    }, {
      "id": "3",
      "title": "Accounts",
      "gifUrl": "playstore3",
      "description": "Google is the company that created the system that runs your phone (Android) and the Play Store. They want you to have a Google account before you use the Play Store. So, If you’re using the Play Store for the first time, you may be asked to set up a Google account.<br><br>You can pick a username and a strong password for your account when you sign up. If you need help coming up with a good password, look at <a href=\"mozilladso:///tutorials/accounts_passwords\">Accounts and Passwords</a>."
    }, {
      "id": "4",
      "title": "Ready for Apps!",
      "gifUrl": "playstore4",
      "description": "Now that you have access to the Play Store, you can look for apps you want! There are millions to choose from to help organize your life, search for information, have fun, and more. You just have to search!"
    }, {
      "id": "5",
      "title": "Searching for Apps",
      "gifUrl": "playstore5",
      "description": "The Play Store is full of apps. If you've heard someone mention an app, if you want to find something new, or if you want to solve a problem, try searching.<br><br>In the Play Store, find the Search button <img src=\"ic_search_white_24dp\"/>, or Search bar, and type in what you need. For example <b><font color=\"#E4BC4D\">temple run</font></b>, <b><font color=\"#E4BC4D\">good news bible</font></b>, <b><font color=\"#E4BC4D\">KCB</font></b>, or <b><font color=\"#E4BC4D\">photo editing</font></b>."
    }, {
      "id": "6",
      "title": "Browsing for Apps",
      "gifUrl": "playstore6",
      "description": "You can also look at lists of apps in different categories and discover new ones as you look.  Try clicking on the different categories to look for new and interesting apps."
    }, {
      "id": "7",
      "title": " Reviewing and Downloading",
      "gifUrl": "playstore7",
      "description": "Before downloading an app, always look at its rating, description and the comments posted about it by other people to learn more about the app. Because apps can be made by anybody, ratings and comments are the best way to know if an app does what it claims, or if it is poorly made."
    }, {
      "id": "8",
      "title": "Downloading",
      "gifUrl": "playstore8",
      "description": "To download an app, simply click on the <b><font color=\"#E4BC4D\">Install button</font></b>.<br><br>You may also want to see how much <b><font color=\"#E4BC4D\">Storage Space</font></b> an app will consume. Look for the <b><font color=\"#E4BC4D\">READ MORE</font></b> link, and then find <b><font color=\"#E4BC4D\">Download Size</font></b>. If you've had trouble with space for your apps in the past, check out <a href=\"mozilladso:///tutorials/storage\">Freeing up Memory</a> for some tips."
    }, {
      "id": "9",
      "title": "Giving your own review",
      "gifUrl": "playstore9",
      "description": "Once you’ve downloaded and used an app, you can rate it and comment about it in the Play Store. Your feedback helps create a safe environment by giving people reliable information about whether or not apps are well-made, useful and appropriate."
    }, {
      "id": "10",
      "title": "Updating",
      "gifUrl": "auto_update",
      "description": "Occasionally, app creators will need to update or change the content of the app. So, often, they issue updates for their apps through the Play Store.\nUpdating apps consumes data. However, the Play Store will try to download updates automatically when you’re connected to a Wi-Fi hotspot. Check out <a href=\"mozilladso:///tutorials/data/8\">Disable Auto-Update</a> if you suspect that apps are being updated with your mobile data connection."
    }]
  },{
    "id": "8",
    "tag": "accounts_passwords",
    "header": "Accounts and Passwords",
    "photoUrl": "url",
    "steps": [{
      "id": "1",
      "title": "Accounts",
      "gifUrl": "accounts1",
      "description": "An account is the identity you use to sign into and use an app or service. Companies and other people can often observe your account activity to see how you use apps, services, and websites."
    }, {
      "id": "2",
      "title": "Multiple Accounts",
      "gifUrl": "accounts2",
      "description": "Companies often want you to make an account specifically for their services. For example, Facebook wants you to have a Facebook account to interact with people there, and Google wants you to have a Google account to use apps like the Play Store."
    }, {
      "id": "3",
      "title": "A Different Password for Each Account",
      "gifUrl": "accounts3",
      "description": "<b><font color=\"#E4BC4D\">You should use a different password for every account you make.</font></b>\nImagine you use Facebook and Gmail with the same password. If someone discovers your Facebook password, they also have access to your Gmail. By using a different password for every account, the only account they have access to is Facebook."
    }, {
      "id": "4",
      "title": "Making a Strong Password",
      "gifUrl": "accounts4",
      "description": "Strong passwords usually have\n<ul><li>At least 8 characters.</li><li>Uppercase and lowercase letters.</li><li>Letters, numbers, and punctuation marks.</li></ul><br><br>Try to pick passwords that are memorable to you, <b><font color=\"#E4BC4D\">but not based on personal information</font></b> other people can easily find out about you.<br><br>For example, avoid using your <b><font color=\"#E4BC4D\">date of birth</font></b> to create a pin or password. <b><font color=\"#E4BC4D\">People can guess that easily!</font></b>"
    }, {
      "id": "5",
      "title": "Using a Memorable Sentence",
      "gifUrl": "accounts5",
      "description": "To create and remember a strong password, think of a memorable sentence and use the first letter of each word. For example, \"<b><font color=\"#E4BC4D\">I buy 2 mangos at the market every week</font></b>\" becomes \"<b><font color=\"#E4BC4D\">Ib2matmew</font></b>\" ."
    }, {
      "id": "6",
      "title": "Using a String of Random Words",
      "gifUrl": "accounts6",
      "description": "Random strings of common words, such as \"Mousetrap Sandwich Hospital Anecdote,\" tend to work well, too.\nTo help you remember the words you choose, use them to imagine a scene. For example, cat, home, battery, and cake, might become \"a cat living in a house on a cake made of batteries\"."
    }, {
      "id": "7",
      "title": "What kinds of passwords should I avoid?",
      "gifUrl": "accounts7",
      "description": "Impostors can easily break short passwords and passwords made up of sequential numbers like \"1234\". They can also guess passwords that are made of simple words like \"mydata\". Impostors can use what they know about you to guess passwords based on important dates in your life (such as birthdays or anniversaries) or the names of people (including celebrities and sports teams) or places you know."
    }]
  }],
  "quizes": [
    {
      "id": "1",
      "question": "to set an alarm on your phone.",
      "answer": "ic_alarm_white_48dp",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "2",
      "question": "to share music with a friend.",
      "answer": "ic_bluetooth_connected_white_48dp",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "3",
      "question": "to use an online map.",
      "answer": "ic_location_on_white_48dp",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "4",
      "question": "to customise and manage your phone.",
      "answer": "ic_settings_applications_white_48dp",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "5",
      "question": "to use someone else’s internet over Wi-Fi.",
      "answer": "ic_network_wifi_white_48dp",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "6",
      "question": "to discover and download new apps.",
      "answer": "googleplay_white",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "7",
      "question": "to add and edit contacts.",
      "answer": "ic_contacts_white_48dp",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "8",
      "question": "to send tweets and see what's going on in the world.",
      "answer": "twitter_white",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "9",
      "question": "to disconnect all signals to and from your phone.",
      "answer": "ic_airplanemode_active_white_48dp",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "10",
      "question": "to use everyone’s favourite chat app.",
      "answer": "whatsapp_white",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "11",
      "question": "that represents your phone's operating system.",
      "answer": "ic_android_white_48dp",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "12",
      "question": "to know that something is being downloaded.",
      "answer": "ic_get_app_white_48dp",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "13",
      "question": "that represents the world's biggest social network.",
      "answer": "facebook_white",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "14",
      "question": "to search for something.",
      "answer": "ic_search_white_48dp",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "15",
      "question": "see your week's important events",
      "answer": "calendar_white",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "16",
      "question": "to search for information or websites.",
      "answer": "opera_white",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    },
    {
      "id": "17",
      "question": "to search for apps.",
      "answer": "googleplay_white",
      "optiona": "","optionb": "","optionc": "","optiond": ""
    }
  ]
}